interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoFloat-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoFloat soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputFloat id="id0" xsi:type="xsd:float">-334.5</inputFloat>
      </ns1:echoFloat>
   </soapenv:Body>
</soapenv:Envelope>